witalis3/UA3REO-DDC-Transceiver/STM32/Src/peripheral.c
#include "stm32h7xx_hal.h"
#include "main.h"
#include "peripheral.h"
#include "lcd.h"
#include "trx_manager.h"
#include "agc.h"
#include "settings.h"
#include "system_menu.h"
#include "functions.h"
#include "audio_filters.h"

static bool PERIPH_SPI_busy = false;
static bool FRONTPanel_MCP3008_1_Enabled = true;
static bool FRONTPanel_MCP3008_2_Enabled = true;

static uint8_t ENCODER_ALast = 0;
static uint8_t ENCODER_AVal = 0;
static int32_t ENCODER_slowler = 0;
static uint8_t ENCODER2_ALast = 0;
static uint8_t ENCODER2_AVal = 0;
static uint32_t ENCODER2_AValDeb = 0;
static bool ENCODER2_SWLast = true;

volatile PERIPH_FrontPanel_Type PERIPH_FrontPanel = {0};

static void PERIPH_ENCODER_Rotated(int direction);
static void PERIPH_ENCODER2_Rotated(int direction);
static uint16_t PERIPH_ReadMCP3008_Value(uint8_t channel, GPIO_TypeDef *CS_PORT, uint16_t CS_PIN);

void PERIPH_ENCODER_checkRotate(void)
{

	ENCODER_AVal = HAL_GPIO_ReadPin(ENC_CLK_GPIO_Port, ENC_CLK_Pin);
	if (ENCODER_ALast != ENCODER_AVal)
	{
		ENCODER_ALast = ENCODER_AVal;
		if (ENCODER_AVal != HAL_GPIO_ReadPin(ENC_DT_GPIO_Port, ENC_DT_Pin))
		{ // Если вывод A изменился первым - вращение по часовой стрелке
			ENCODER_slowler--;
			if (ENCODER_slowler < -TRX.ENCODER_SLOW_RATE)
			{
				PERIPH_ENCODER_Rotated(ENCODER_INVERT ? 1 : -1);
				ENCODER_slowler = 0;
			}
		}
		else
		{ // иначе B изменил свое состояние первым - вращение против часовой стрелки
			ENCODER_slowler++;
			if (ENCODER_slowler > TRX.ENCODER_SLOW_RATE)
			{
				PERIPH_ENCODER_Rotated(ENCODER_INVERT ? -1 : 1);
				ENCODER_slowler = 0;
			}
		}
	}
}

void PERIPH_ENCODER2_checkRotate(void)
{
	if((HAL_GetTick() - ENCODER2_AValDeb) < 20) return;
	ENCODER2_AValDeb = HAL_GetTick();
	ENCODER2_AVal = HAL_GPIO_ReadPin(ENC2_CLK_GPIO_Port, ENC2_CLK_Pin);

	if (ENCODER2_ALast != ENCODER2_AVal)
	{
		ENCODER2_ALast = ENCODER2_AVal;
		if (ENCODER2_AVal != HAL_GPIO_ReadPin(ENC2_DT_GPIO_Port, ENC2_DT_Pin))
		{ // Если вывод A изменился первым - вращение по часовой стрелке
			PERIPH_ENCODER2_Rotated(ENCODER2_INVERT ? 1 : -1);
		}
		else
		{ // иначе B изменил свое состояние первым - вращение против часовой стрелки
			PERIPH_ENCODER2_Rotated(ENCODER2_INVERT ? -1 : 1);
		}
	}
}

static void PERIPH_ENCODER_Rotated(int direction) //энкодер повернули, здесь обработчик, direction -1 - влево, 1 - вправо
{
	TRX_Time_InActive = 0;
	if (TRX.Locked)
		return;

	if (LCD_systemMenuOpened && !LCD_timeMenuOpened)
	{
		eventRotateSystemMenu(direction);
		return;
	}
	if (!LCD_timeMenuOpened)
	{
		VFO *vfo = CurrentVFO();
		if (TRX.Fast)
		{
			TRX_setFrequency(TRX_getFrequency(vfo) + 100 * direction, vfo);
			if ((TRX_getFrequency(vfo) % 100) > 0)
				TRX_setFrequency(TRX_getFrequency(vfo) / 100 * 100, vfo);
		}
		else
		{
			TRX_setFrequency(TRX_getFrequency(vfo) + 10 * direction, vfo);
			if ((TRX_getFrequency(vfo) % 10) > 0)
				TRX_setFrequency(TRX_getFrequency(vfo) / 10 * 10, vfo);
		}
		LCD_UpdateQuery.FreqInfo = true;
	}
	if (LCD_timeMenuOpened)
	{
		uint32_t Time = RTC->TR;
		RTC_TimeTypeDef sTime;
		sTime.TimeFormat = RTC_HOURFORMAT12_PM;
		sTime.SubSeconds = 0;
		sTime.SecondFraction = 0;
		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
		sTime.StoreOperation = RTC_STOREOPERATION_SET;
		sTime.Hours = (uint8_t)(((Time >> 20) & 0x03) * 10 + ((Time >> 16) & 0x0f));
		sTime.Minutes = (uint8_t)(((Time >> 12) & 0x07) * 10 + ((Time >> 8) & 0x0f));
		sTime.Seconds = (uint8_t)(((Time >> 4) & 0x07) * 10 + ((Time >> 0) & 0x0f));
		if (TimeMenuSelection == 0)
		{
			if (sTime.Hours == 0 && direction < 0)
				return;
			sTime.Hours = sTime.Hours + direction;
		}
		if (TimeMenuSelection == 1)
		{
			if (sTime.Minutes == 0 && direction < 0)
				return;
			sTime.Minutes = sTime.Minutes + direction;
		}
		if (TimeMenuSelection == 2)
		{
			if (sTime.Seconds == 0 && direction < 0)
				return;
			sTime.Seconds = sTime.Seconds + direction;
		}
		if (sTime.Hours >= 24)
			sTime.Hours = 0;
		if (sTime.Minutes >= 60)
			sTime.Minutes = 0;
		if (sTime.Seconds >= 60)
			sTime.Seconds = 0;
		HAL_RTC_DeInit(&hrtc);
		HAL_RTC_Init(&hrtc);
		HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
		LCD_UpdateQuery.SystemMenu = true;
		return;
	}
	NeedSaveSettings = true;
}

static void PERIPH_ENCODER2_Rotated(int direction) //энкодер повернули, здесь обработчик, direction -1 - влево, 1 - вправо
{
	TRX_Time_InActive = 0;
	if (TRX.Locked)
		return;

	if (LCD_systemMenuOpened || LCD_timeMenuOpened)
	{
		eventSecRotateSystemMenu(direction);
		return;
	}

	//NOTCH - default action
	if (TRX.NotchFilter)
	{
		if (TRX.NotchFC > 50 && direction < 0)
			TRX.NotchFC -= 25;
		else if (TRX.NotchFC < CurrentVFO()->Filter_Width && direction > 0)
			TRX.NotchFC += 25;
		LCD_UpdateQuery.StatusInfoGUI = true;
		NeedReinitNotch = true;
	}
	else
	{
		VFO *vfo = CurrentVFO();
		if (TRX.Fast)
		{
			TRX_setFrequency(TRX_getFrequency(vfo) + 100000 * direction, vfo);
			if ((TRX_getFrequency(vfo) % 100000) > 0)
				TRX_setFrequency(TRX_getFrequency(vfo) / 100000 * 100000, vfo);
		}
		else
		{
			TRX_setFrequency(TRX_getFrequency(vfo) + 25000 * direction, vfo);
			if ((TRX_getFrequency(vfo) % 25000) > 0)
				TRX_setFrequency(TRX_getFrequency(vfo) / 25000 * 25000, vfo);
		}
		LCD_UpdateQuery.FreqInfo = true;
	}
}

void PERIPH_ENCODER2_checkSwitch(void)
{
	if (TRX.Locked)
		return;

	bool ENCODER2_SWNow = HAL_GPIO_ReadPin(ENC2_SW_GPIO_Port, ENC2_SW_Pin);
	if (ENCODER2_SWLast != ENCODER2_SWNow)
	{
		ENCODER2_SWLast = ENCODER2_SWNow;
		if (!ENCODER2_SWNow)
		{
			TRX_Time_InActive = 0;
		}
	}
}

void PERIPH_RF_UNIT_UpdateState(bool clean) //передаём значения в RF-UNIT
{
	bool hpf_lock = false;
	HAL_GPIO_WritePin(RFUNIT_RCLK_GPIO_Port, RFUNIT_RCLK_Pin, GPIO_PIN_RESET); //защёлка
	MINI_DELAY
	for (uint8_t registerNumber = 0; registerNumber < 24; registerNumber++)
	{
		HAL_GPIO_WritePin(RFUNIT_CLK_GPIO_Port, RFUNIT_CLK_Pin, GPIO_PIN_RESET); //клок данных
		MINI_DELAY
		HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_RESET); //данные
		MINI_DELAY
		if (!clean)
		{
			//REGISTER 1
			//if(registerNumber==0) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			if(registerNumber==1 && !TRX_on_TX() && TRX.LNA) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // LNA
			//if(registerNumber==2) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			//if(registerNumber==3) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			//if(registerNumber==4) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			//if(registerNumber==5) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			//if(registerNumber==6) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			if (registerNumber == 7 && TRX_on_TX() && TRX_getMode(CurrentVFO()) != TRX_MODE_LOOPBACK)
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //TX_RX
			
			//REGISTER 2
			if (registerNumber == 8 && TRX_on_TX() && TRX_getMode(CurrentVFO()) != TRX_MODE_LOOPBACK) //TX_AMP
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET);
			if (registerNumber == 9 && TRX.ATT) //ATT_ON
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET);
			if (registerNumber == 10 && (!TRX.LPF || TRX_getFrequency(CurrentVFO()) > CALIBRATE.LPF_END)) //LPF_OFF
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 11 && (!TRX.BPF || TRX_getFrequency(CurrentVFO()) < CALIBRATE.BPF_1_START)) //BPF_OFF
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 12 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= CALIBRATE.BPF_0_START && TRX_getFrequency(CurrentVFO()) < CALIBRATE.BPF_0_END) //BPF_0
			{
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
				hpf_lock = true;														 //блокируем HPF для выделенного BPF фильтра УКВ
			}
			if (registerNumber == 13 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= CALIBRATE.BPF_7_HPF && !hpf_lock)
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_7_HPF
			if (registerNumber == 14 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= CALIBRATE.BPF_6_START && TRX_getFrequency(CurrentVFO()) < CALIBRATE.BPF_6_END)
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_6
			//if(registerNumber==15) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			
			//REGISTER 3
			//if(registerNumber==16) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			//if(registerNumber==17) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			if (registerNumber == 18 && ((TRX_on_TX() && TRX_getMode(CurrentVFO()) != TRX_MODE_LOOPBACK) || TRX_Fan_Timeout > 0)) //FAN
			{
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
				if (TRX_Fan_Timeout > 0)
					TRX_Fan_Timeout--;
			}
			if (registerNumber == 19 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= CALIBRATE.BPF_1_START && TRX_getFrequency(CurrentVFO()) < CALIBRATE.BPF_1_END) //BPF_1
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 20 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= CALIBRATE.BPF_2_START && TRX_getFrequency(CurrentVFO()) < CALIBRATE.BPF_2_END) //BPF_2
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 21 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= CALIBRATE.BPF_3_START && TRX_getFrequency(CurrentVFO()) < CALIBRATE.BPF_3_END) //BPF_3
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 22 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= CALIBRATE.BPF_4_START && TRX_getFrequency(CurrentVFO()) < CALIBRATE.BPF_4_END) //BPF_4
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 23 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= CALIBRATE.BPF_5_START && TRX_getFrequency(CurrentVFO()) < CALIBRATE.BPF_5_END) //BPF_5
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			
